     A* This file is part of cisco-erfassung, an application conglomerate for
     A*  management of Cisco devices on AS/400, i5/OS and IBM i.
     A*
     A* This is free software; you can redistribute it and/or modify it
     A*  under the terms of the GNU General Public License as published by the
     A*  Free Software Foundation; either version 2 of the License, or (at your
     A*  option) any later version.
     A*
     A* It is distributed in the hope that it will be useful, but WITHOUT
     A*  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
     A*  FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
     A*  for more details.
     A*
     A* You should have received a copy of the GNU General Public License along
     A*  with it; if not, write to the Free Software Foundation, Inc., 59
     A*  Temple Place, Suite 330, Boston, MA 02111-1307 USA or get it at
     A*  http://www.gnu.org/licenses/gpl.html
     A*
     A* Globals ----------------------------------------------------------------
     A                                      DYNSLT
     A* Record Format Name -----------------------------------------------------
     A          R ACUPDATES                 JFILE(ACDCAPF HSTPF ACMATCHPF)
     A          J                           JOIN(ACDCAPF HSTPF)
     A                                      JFLD(HOSTNAME HOSTNAME)
     A          J                           JOIN(ACDCAPF ACMATCHPF)
     A                                      JFLD(AC_TYPE AC_TYPE)
     A* Data fields ------------------------------------------------------------
     A            HOSTNAME                  JREF(1)
     A            ACU_IGN                   JREF(2)
     A            AC_T_IST                  JREF(1) RENAME(AC_TYPE)
     A            AC_T_SOLL                 JREF(3) RENAME(AC_TYPE)
     A            AC_V_IST                  JREF(1) RENAME(AC_VER)
     A            AC_V_SOLL                 JREF(3) RENAME(AC_VER)
     A* Key field(s) -----------------------------------------------------------
     A* Beware, key fields are required to be in the first referenced JFILE!
     A          K HOSTNAME
     A          K AC_T_IST
     A          K AC_V_IST
     A* Select/Omit ------------------------------------------------------------
     A          O ACU_IGN                   COMP(EQ 1)
     A          O AC_V_IST                  COMP(EQ AC_V_SOLL)
     A          S AC_T_IST                  COMP(EQ AC_T_SOLL)
     A          O                           ALL
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
