     A* This file is part of cisco-erfassung, an application conglomerate for
     A*  management of Cisco devices on AS/400, i5/OS and IBM i.
     A*
     A* This is free software; you can redistribute it and/or modify it
     A*  under the terms of the GNU General Public License as published by the
     A*  Free Software Foundation; either version 2 of the License, or (at your
     A*  option) any later version.
     A*
     A* It is distributed in the hope that it will be useful, but WITHOUT
     A*  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
     A*  FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
     A*  for more details.
     A*
     A* You should have received a copy of the GNU General Public License along
     A*  with it; if not, write to the Free Software Foundation, Inc., 59
     A*  Temple Place, Suite 330, Boston, MA 02111-1307 USA or get it at
     A*  http://www.gnu.org/licenses/gpl.html
     A*
     A* Globals ----------------------------------------------------------------
     A                                      UNIQUE
     A* Record Format Name -----------------------------------------------------
     A          R DCATBL
     A* Data fields
     A            HOSTNAME  R               REFFLD(HOSTNAME HSTPF)
     A            STAMP           Z         TEXT('Last uptate of this record')
     A            MODEL         20A
     A            VERSION       20A         TEXT('Running firmware version')
     A            SERNO         12A         TEXT('Main chassis serial #')
     A            UPTIME_MIN    10S 0       TEXT('Uptime in minutes')
     A            FLASH          5S 0
     A            RAM            4S 0
     A            RLD$REASON    84A         ALWNULL
     A            SYSIMG        80A         ALWNULL
     A            UPTIME        52A         ALWNULL TEXT('Textual uptime')
     A            CFUPDT          Z         ALWNULL TEXT('Device cfg changed')
     A            CFSAVD          Z         ALWNULL TEXT('Device cfg written')
     A            ASA_DM_VER    20A         ALWNULL TEXT('ASDM version')
     A            VTP_DOMAIN    16A         ALWNULL
     A            VTP_MODE      16A         ALWNULL
     A            CONFREG        6A         ALWNULL
     A            VTP_VERS       1S 0       ALWNULL
     A            VTP_PRUNE      1A         ALWNULL
     A            ASA_FOVER      1A         ALWNULL TEXT('ASA FO-cluster')
     A* Index field(s)
     A          K HOSTNAME
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
