     A* This file is part of cisco-erfassung, an application conglomerate for
     A*  management of Cisco devices on AS/400, i5/OS and IBM i.
     A*
     A* This is free software; you can redistribute it and/or modify it
     A*  under the terms of the GNU General Public License as published by the
     A*  Free Software Foundation; either version 2 of the License, or (at your
     A*  option) any later version.
     A*
     A* It is distributed in the hope that it will be useful, but WITHOUT
     A*  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
     A*  FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
     A*  for more details.
     A*
     A* You should have received a copy of the GNU General Public License along
     A*  with it; if not, write to the Free Software Foundation, Inc., 59
     A*  Temple Place, Suite 330, Boston, MA 02111-1307 USA or get it at
     A*  http://www.gnu.org/licenses/gpl.html
     A*
     A* Globals ----------------------------------------------------------------
     A                                      UNIQUE
     A* Record Format Name -----------------------------------------------------
     A          R HOSTS
     A* Data fields
     A            HOSTNAME      38A
     A            PASSWD        16A
     A            CONN           6A
     A            SERVTYP        3A
     A            DCA            2S 0       TEXT('Flag for automatic dta coll.')
     A            UPD_IGN        2S 0       TEXT('Ignore available OS updates.')
     A            ACU_IGN        2S 0       TEXT('Ignore available AC updates.')
     A            COMMT         50A         ALWNULL
     A            ENABLE        16A         ALWNULL
     A            USERNAME      16A         ALWNULL
     A* Index Fields
     A          K HOSTNAME
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
