     A* This file is part of cisco-erfassung, an application conglomerate for
     A*  management of Cisco devices on AS/400, i5/OS and IBM i.
     A*
     A* This is free software; you can redistribute it and/or modify it
     A*  under the terms of the GNU General Public License as published by the
     A*  Free Software Foundation; either version 2 of the License, or (at your
     A*  option) any later version.
     A*
     A* It is distributed in the hope that it will be useful, but WITHOUT
     A*  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
     A*  FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
     A*  for more details.
     A*
     A* You should have received a copy of the GNU General Public License along
     A*  with it; if not, write to the Free Software Foundation, Inc., 59
     A*  Temple Place, Suite 330, Boston, MA 02111-1307 USA or get it at
     A*  http://www.gnu.org/licenses/gpl.html
     A*
     A* Globals ----------------------------------------------------------------
     A                                      JDFTVAL
     A                                      DYNSLT
     A* Record Format Name -----------------------------------------------------
     A          R UPTIMETBL                 JFILE(DCAPF HSTPF)
     A          J                           JOIN(DCAPF HSTPF)
     A                                      JFLD(HOSTNAME HOSTNAME)
     A* Data fields ------------------------------------------------------------
     A            HOSTNAME                  JREF(1)
     A            UPTIME                    JREF(1)
     A            UPTIME_MIN                JREF(1)
     A            DCA                       JREF(2)
     A* Key field(s) -----------------------------------------------------------
     A* Beware, key fields are required to be in the first referenced JFILE!
     A          K UPTIME_MIN                DESCEND
     A          K HOSTNAME
     A* Select/Omit ------------------------------------------------------------
     A          O DCA                       COMP(EQ 0)
     A          S                           ALL
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
